research.html
<div id="outline-container-org5a66d84" class="outline-3">
<h3 id="org5a66d84"><span class="section-number-3">2.2.</span> Parsing Techniques</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The parsing approach we're developing builds on established techniques while introducing innovations for streaming and incremental processing.
</p>
</div>
<div id="outline-container-org946a2fb" class="outline-4">
<h4 id="org946a2fb"><span class="section-number-4">2.2.1.</span> Traditional Parsing with Bison/Flex</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
GNU Bison and Flex provide a solid foundation for implementing our parser. As detailed in citep:Parr2010-PARLAA, these tools enable the creation of parsers that can handle complex grammar specifications.
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;syntax-tree&gt; ::= &lt;node&gt;

&lt;node&gt; ::= "(" &lt;category&gt; &lt;content&gt; &lt;properties&gt;* &lt;child&gt;* ")"

&lt;category&gt; ::= "S" | "NP" | "VP" | "PP" | "ADVP" | "AP" 
             | "PARTCL" | "RELCL" | "INFCL" | "SUBCL" | "NOMCL"
             | "V" | "N" | "DET" | "PRON" | "ADJ" | "ADV" | "P" | "CONJ" | "SUB" | "REL"
             | "PART" | "NUM" | "PUNCT" | "AUX"
</pre>
</div>

<p>
The BNF grammar above defines the structure of our syntax tree notation. Using Bison and Flex, we can generate a parser that validates and processes input according to this grammar.
</p>
</div>
</div>
<div id="outline-container-org74bcba7" class="outline-4">
<h4 id="org74bcba7"><span class="section-number-4">2.2.2.</span> Incremental Parsing for Streaming Input</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Traditional parsing approaches assume complete input is available at parse time. However, when working with streaming sources like LLMs, we need to handle incomplete and evolving input. citep:Erdweg2011-ERDSEL provides insights into extensible parsing approaches that can be adapted for streaming contexts.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">Pseudocode for incremental parser</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">process_token</span>(<span style="color: #228b22;">token_t</span> <span style="color: #a0522d;">token</span>, <span style="color: #228b22;">parser_state_t</span>* <span style="color: #a0522d;">state</span>) {
    <span style="color: #a020f0;">switch</span> (state-&gt;current_mode) {
        <span style="color: #a020f0;">case</span> MODE_EXPECTING_CATEGORY:
            <span style="color: #a020f0;">if</span> (is_category(token)) {
                state-&gt;current_node = create_node(token.value);
                state-&gt;current_mode = MODE_EXPECTING_CONTENT_OR_PROPERTY;
            } <span style="color: #a020f0;">else</span> {
                report_error(<span style="color: #8b2252;">"Expected category, got %s"</span>, token.value);
            }
            <span style="color: #a020f0;">break</span>;

        <span style="color: #b22222;">// </span><span style="color: #b22222;">Other states...</span>
    }
}
</pre>
</div>

<p>
This incremental approach allows us to maintain a partial parse tree that evolves as new tokens arrive from the stream.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org77d1917" class="outline-2">
<h2 id="org77d1917"><span class="section-number-2">3.</span> Implementation Approaches</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orged60204" class="outline-3">
<h3 id="orged60204"><span class="section-number-3">3.1.</span> Parser Implementation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Our parser implementation leverages GNU Bison and Flex to process S-expression syntax trees. As described in citep:Boersma2024-BOEUFD, modern DSL implementations benefit from robust parsing infrastructure.
</p>
</div>
<div id="outline-container-org39ae296" class="outline-4">
<h4 id="org39ae296"><span class="section-number-4">3.1.1.</span> Lexer Specification</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
The lexer identifies tokens in the input stream:
</p>

<div class="org-src-container">
<pre class="src src-flex">%%
"("                         { return LPAREN; }
")"                         { return RPAREN; }
":"                         { return COLON; }
"{"                         { return LBRACE; }
"}"                         { return RBRACE; }

"S"|"NP"|"VP"|"PP"|"ADVP"|"AP"|"PARTCL"|"RELCL"|"INFCL"|"SUBCL"|"NOMCL"|"V"|"N"|"DET"|"PRON"|"ADJ"|"ADV"|"P"|"CONJ"|"SUB"|"REL"|"PART"|"NUM"|"PUNCT"|"AUX" {
                              yylval.str_val = strdup(yytext);
                              return CATEGORY;
                            }
%%
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd14cf9e" class="outline-4">
<h4 id="orgd14cf9e"><span class="section-number-4">3.1.2.</span> Parser Specification</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
The parser defines the grammar rules and actions:
</p>

<div class="org-src-container">
<pre class="src src-bison">%%
syntax_tree
    : node
    { 
        syntax_root = $1;
        $$ = $1;
    }
    ;

node
    : LPAREN category content properties_list node_list RPAREN
    {
        $$ = create_node($2, $3, $4, $5);
    }
    ;
%%
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org23052e5" class="outline-3">
<h3 id="org23052e5"><span class="section-number-3">3.2.</span> Data Structures</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The core data structures for our syntax tree representation are designed to balance flexibility, memory efficiency, and performance.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">node_s</span> {
    <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">category</span>;
    <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">content</span>;
    <span style="color: #228b22;">property_list_t</span>* <span style="color: #a0522d;">properties</span>;
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">node_list_s</span>* <span style="color: #a0522d;">children</span>;
} <span style="color: #228b22;">syntax_node_t</span>;
</pre>
</div>

<p>
These structures support the rich metadata we need for linguistic analysis while maintaining a clean, hierarchical representation.
</p>
</div>
</div>
