research.tex
\subsection{Parsing Techniques}
\label{sec:org86c4e45}

The parsing approach we're developing builds on established techniques while introducing innovations for streaming and incremental processing.
\subsubsection{Traditional Parsing with Bison/Flex}
\label{sec:org72c4602}

GNU Bison and Flex provide a solid foundation for implementing our parser. As detailed in citep:Parr2010-PARLAA, these tools enable the creation of parsers that can handle complex grammar specifications.

\begin{verbatim}
<syntax-tree> ::= <node>

<node> ::= "(" <category> <content> <properties>* <child>* ")"

<category> ::= "S" | "NP" | "VP" | "PP" | "ADVP" | "AP" 
             | "PARTCL" | "RELCL" | "INFCL" | "SUBCL" | "NOMCL"
             | "V" | "N" | "DET" | "PRON" | "ADJ" | "ADV" | "P" | "CONJ" | "SUB" | "REL"
             | "PART" | "NUM" | "PUNCT" | "AUX"
\end{verbatim}

The BNF grammar above defines the structure of our syntax tree notation. Using Bison and Flex, we can generate a parser that validates and processes input according to this grammar.
\subsubsection{Incremental Parsing for Streaming Input}
\label{sec:org76588d1}

Traditional parsing approaches assume complete input is available at parse time. However, when working with streaming sources like LLMs, we need to handle incomplete and evolving input. citep:Erdweg2011-ERDSEL provides insights into extensible parsing approaches that can be adapted for streaming contexts.

\begin{verbatim}
// Pseudocode for incremental parser
void process_token(token_t token, parser_state_t* state) {
    switch (state->current_mode) {
        case MODE_EXPECTING_CATEGORY:
            if (is_category(token)) {
                state->current_node = create_node(token.value);
                state->current_mode = MODE_EXPECTING_CONTENT_OR_PROPERTY;
            } else {
                report_error("Expected category, got %s", token.value);
            }
            break;

        // Other states...
    }
}
\end{verbatim}

This incremental approach allows us to maintain a partial parse tree that evolves as new tokens arrive from the stream.
\section{Implementation Approaches}
\label{sec:orge0d26c9}

\subsection{Parser Implementation}
\label{sec:orgec44bcf}

Our parser implementation leverages GNU Bison and Flex to process S-expression syntax trees. As described in citep:Boersma2024-BOEUFD, modern DSL implementations benefit from robust parsing infrastructure.
\subsubsection{Lexer Specification}
\label{sec:orgc69e8d6}

The lexer identifies tokens in the input stream:

\begin{verbatim}
%%
"("                         { return LPAREN; }
")"                         { return RPAREN; }
":"                         { return COLON; }
"{"                         { return LBRACE; }
"}"                         { return RBRACE; }

"S"|"NP"|"VP"|"PP"|"ADVP"|"AP"|"PARTCL"|"RELCL"|"INFCL"|"SUBCL"|"NOMCL"|"V"|"N"|"DET"|"PRON"|"ADJ"|"ADV"|"P"|"CONJ"|"SUB"|"REL"|"PART"|"NUM"|"PUNCT"|"AUX" {
                              yylval.str_val = strdup(yytext);
                              return CATEGORY;
                            }
%%
\end{verbatim}
\subsubsection{Parser Specification}
\label{sec:org208b008}

The parser defines the grammar rules and actions:

\begin{verbatim}
%%
syntax_tree
    : node
    { 
        syntax_root = $1;
        $$ = $1;
    }
    ;

node
    : LPAREN category content properties_list node_list RPAREN
    {
        $$ = create_node($2, $3, $4, $5);
    }
    ;
%%
\end{verbatim}
\subsection{Data Structures}
\label{sec:org88788cd}

The core data structures for our syntax tree representation are designed to balance flexibility, memory efficiency, and performance.

\begin{verbatim}
typedef struct node_s {
    char* category;
    char* content;
    property_list_t* properties;
    struct node_list_s* children;
} syntax_node_t;
\end{verbatim}

These structures support the rich metadata we need for linguistic analysis while maintaining a clean, hierarchical representation.
